app/Http/Controllers/Front/MainController.php

    public function showAllEnabled()
    {
        $records = Aqar::where('bu_status', 1)->orderBy('id', 'desc')->paginate(15);
---
select * from `aqars` where `bu_status` = 1 order by `id` desc limit 15 offset 0
select count(*) as aggregate from `aqars` where `bu_status` = 1