app/help/helper.php

function unReadMessage()
{
    return \App\ContactUs::where('is_read', 0)->get();
---
select * from `contact_us` where `is_read` = 0

function countUnreadMessages()
{
    return \App\ContactUs::where('is_read', 0)->count();
---
select count(*) as aggregate from `contact_us` where `is_read` = 0

function aqarForUser($id, $status)
{
    return Aqar::where('bu_status', $status)->where('user_id', $id)->count();
---
select count(*) as aggregate from `aqars` where `bu_status` = 1 and `user_id` = 1