app/Http/Controllers/Admin/AdminController.php

    public function index()
    {

        $charts = Aqar::select(DB::raw('COUNT(*) AS counting , month'))->where('year', date('Y'))
            ->groupBy('month')->orderBy('month', 'asc')->get()->toArray();
---
select COUNT(*) AS counting , month from `aqars` where `year` = '2020' group by `month` order by `month` asc

    public function aqarsStatus()
    {
        $year = date('Y');
        $charts = Aqar::select(DB::raw('COUNT(*) AS counting , month '))->where('year', date('Y'))
            ->groupBy('month')->orderBy('month', 'asc')->get()->toArray();
---
select COUNT(*) AS counting , month from `aqars` where `year` = '2021' group by `month` order by `month` asc

    public function showAqarsYear(Request $request)
    {
        $year = $request->year;
        $charts = Aqar::select(DB::raw('COUNT(*) AS counting , month'))->where('year', $year)
            ->groupBy('month')->orderBy('month', 'asc')->get()->toArray();
---
select COUNT(*) AS counting , month from `aqars` where `year` = '2020' group by `month` order by `month` asc