app/Http/Controllers/Admin/ContactUsController.php

    public function anyData()
    {
        $contacts = ContactUs::all();
---
select * from `contact_us`