app/Http/Controllers/Admin/UsersController.php

select count(*) as aggregate from `aqars` where `user_id` = '4' and `bu_status` = 0
select count(*) as aggregate from `aqars` where `user_id` = '4' and `bu_status` = 1
---
    public function edit($id)
    {
        $user = User::findOrFail($id);
        $aqarWaiting = Aqar::where('user_id', $id)->where('bu_status', 0)->paginate(10);
        $aqarEnabled = Aqar::where('user_id', $id)->where('bu_status', 1)->paginate(10);